In [179]:
import pandas as pd
import numpy as np
pd.__version__

'2.2.2'

Creating Series

In [180]:
lst = [1,2,3,4,5]
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [181]:
arr = np.array([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [182]:
pd.Series(data = ["Anshu","Ashish","Rahul","Ishant"],index = [1,2,3,4])

1     Anshu
2    Ashish
3     Rahul
4    Ishant
dtype: object

In [183]:
steps = {'day1':3000,'day2':4000,'day3':5999}
pd.Series(steps)

day1    3000
day2    4000
day3    5999
dtype: int64

In [184]:
pd.Series([2,23,4,5,6,32])

0     2
1    23
2     4
3     5
4     6
5    32
dtype: int64

In [185]:
pd.Series(3).repeat(5)                    #create a series of 3 repeating 5 times

0    3
0    3
0    3
0    3
0    3
dtype: int64

In [186]:
#to change the index
pd.Series(3).repeat(5).reset_index()

   index  0
0      0  3
1      0  3
2      0  3
3      0  3
4      0  3

In [187]:
s = pd.Series([10,20]).repeat([4,2]).reset_index()         #10 is repeated 4 times and 20 is repeated 2 times
s

   index   0
0      0  10
1      0  10
2      0  10
3      0  10
4      1  20
5      1  20

In [188]:
# to access the elements of series
s[1:4]

   index   0
1      0  10
2      0  10
3      0  10

In [189]:
s[2:-2]

   index   0
2      0  10
3      0  10

In [190]:
#Aggregate function
sr = pd.Series([1,2,3,4,5,6,7,8,9,10])
# print(sr)
sr.max()
sr.min()
sr.sum()
#now to print these all together
sr.agg([min,max,sum])

C:\Users\kulwa\AppData\Local\Temp\ipykernel_20264\325550120.py:8: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sr.agg([min,max,sum])
C:\Users\kulwa\AppData\Local\Temp\ipykernel_20264\325550120.py:8: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sr.agg([min,max,sum])
C:\Users\kulwa\AppData\Local\Temp\ipykernel_20264\325550120.py:8: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  sr.agg([min,max,sum])

min     1
max    10
sum    55
dtype: int64

In [191]:
#Append Different Series
sr1 = pd.Series([1,2,3,4,5,6,7,8,9,10])
sr2 = pd.Series([11,12,13,14,15,16,18,19,20])
sr3 = pd.concat([sr1,sr2])
sr3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
0    11
1    12
2    13
3    14
4    15
5    16
6    18
7    19
8    20
dtype: int64

In [192]:
#reset index
sr3 = sr3.reset_index(drop=True)
sr3

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    18
17    19
18    20
dtype: int64

In [193]:
type(sr1[2])

numpy.int64

In [194]:
#to convert the type
sr1.astype('float')

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

In [195]:
#between function
sr2.between(12,17)

0    False
1     True
2     True
3     True
4     True
5     True
6    False
7    False
8    False
dtype: bool

In [196]:
#String Operation
domain = pd.Series(['  Web Development','Machine Learning','Data Science','Cyber','Cloud Computing   '])
domain

0       Web Development
1      Machine Learning
2          Data Science
3                 Cyber
4    Cloud Computing
dtype: object

In [197]:
#to make these all in uppercase/lowecase
print(domain.str.lower())
print("-"*50)
print(domain.str.upper())
print("-"*50)
#to check the length
for i in domain:
    print(i,len(i))

0       web development
1      machine learning
2          data science
3                 cyber
4    cloud computing
dtype: object
--------------------------------------------------
0       WEB DEVELOPMENT
1      MACHINE LEARNING
2          DATA SCIENCE
3                 CYBER
4    CLOUD COMPUTING
dtype: object
--------------------------------------------------
  Web Development 17
Machine Learning 16
Data Science 12
Cyber 5
Cloud Computing    18

In [198]:
#Strip function    (will remove if there are any unecessary spaces in the starting or end of a element)
domain = domain.str.strip()
for i in domain:
    print(i,len(i))

Web Development 15
Machine Learning 16
Data Science 12
Cyber 5
Cloud Computing 15

In [199]:
#Split Function (will split "Data Science" into "Data" and "Science")
domain.str.split()

0     [Web, Development]
1    [Machine, Learning]
2        [Data, Science]
3                [Cyber]
4     [Cloud, Computing]
dtype: object

In [200]:
#if we want to split a particular word
domain.str.split()[1]

['Machine', 'Learning']

In [201]:
sere = pd.Series(["23/32","23/65","543/3453","3453/33345"])
sere.str.split("/")

0         [23, 32]
1         [23, 65]
2      [543, 3453]
3    [3453, 33345]
dtype: object

In [202]:
#Contain function
domain.str.contains("Machine")

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [203]:
#replace function
domain.str.replace(" ","@")

0     Web@Development
1    Machine@Learning
2        Data@Science
3               Cyber
4     Cloud@Computing
dtype: object

In [204]:
#to count the a particular element
domain.str.count("a")

0    0
1    2
2    2
3    0
4    0
dtype: int64

In [205]:
#to check starts or endswith
print(domain.str.endswith("g"))
domain.str.startswith("C")

0    False
1     True
2    False
3    False
4     True
dtype: bool

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [206]:
#to search a element
domain.str.find("Web")

0    0
1   -1
2   -1
3   -1
4   -1
dtype: int64

In [207]:
#Converting Series into list
domain.to_list()
type(domain.to_list())

list

DataFrame

In [208]:
#Creating DataFrame
lst = ["Python ","has ","a ","lot ","of ","libraries ","that ","makes ","code ","easy ","to ","write ","and ","understand "]
pd.DataFrame(lst)

              0
0       Python
1          has
2            a
3          lot
4           of
5    libraries
6         that
7        makes
8         code
9         easy
10          to
11       write
12         and
13  understand

In [209]:
lst = [['oggy',10],['jack',23],['cockroachs',34]]
pd.DataFrame(lst)

            0   1
0        oggy  10
1        jack  23
2  cockroachs  34

In [210]:
data = {'name':['Tom','nick','krish','jack'],'age':[20,21,19,12]}
pd.DataFrame(data)

    name  age
0    Tom   20
1   nick   21
2  krish   19
3   jack   12

In [211]:
#using dictionary
data = {"Name"          :["Anshu","Price","Rajesh","Rohan"],
        "Age"          :[20,22,21,24],
        "Address"      :["Jaipur","Jodhpur","Udaipur","Srinagar"],
        "Degree"       :["B.Sc.","B.Tech","M.Sc.","MBA"]
        }
df = pd.DataFrame(data)
print(df)
print("-"*50)
#if we want to take few columns only
df_new = df[["Name","Degree"]]
print(df_new)

     Name  Age   Address  Degree
0   Anshu   20    Jaipur   B.Sc.
1   Price   22   Jodhpur  B.Tech
2  Rajesh   21   Udaipur   M.Sc.
3   Rohan   24  Srinagar     MBA
--------------------------------------------------
     Name  Degree
0   Anshu   B.Sc.
1   Price  B.Tech
2  Rajesh   M.Sc.
3   Rohan     MBA

In [212]:
#to represent some specific columns only
print(df.loc[1:2])
print("-"*50)
print(df.loc[1:2,"Age":"Degree"])

     Name  Age  Address  Degree
1   Price   22  Jodhpur  B.Tech
2  Rajesh   21  Udaipur   M.Sc.
--------------------------------------------------
   Age  Address  Degree
1   22  Jodhpur  B.Tech
2   21  Udaipur   M.Sc.

In [213]:
#iloc 
#the difference between loc and iloc is that in loc we need to give the name of rows and column but on the otherhand in iloc we need to give the index
df.iloc[1:-1,2:4]

   Address  Degree
1  Jodhpur  B.Tech
2  Udaipur   M.Sc.

In [214]:
df["Name"]

0     Anshu
1     Price
2    Rajesh
3     Rohan
Name: Name, dtype: object

In [215]:
df["Age"]>20

0    False
1     True
2     True
3     True
Name: Age, dtype: bool

In [216]:
df.loc[df['Age']>23,["Name","Age","Degree"]]      #df.loc[row,column]

    Name  Age Degree
3  Rohan   24    MBA

In [217]:
#Add a new column  (same for series and list)
lst = ["IIT","NIT","IIM","Pvt."]
df["Clg"] = lst
df

     Name  Age   Address  Degree   Clg
0   Anshu   20    Jaipur   B.Sc.   IIT
1   Price   22   Jodhpur  B.Tech   NIT
2  Rajesh   21   Udaipur   M.Sc.   IIM
3   Rohan   24  Srinagar     MBA  Pvt.

In [218]:
#to add column using existing column
df["Age+10"] = df["Age"]+10
df

     Name  Age   Address  Degree   Clg  Age+10
0   Anshu   20    Jaipur   B.Sc.   IIT      30
1   Price   22   Jodhpur  B.Tech   NIT      32
2  Rajesh   21   Udaipur   M.Sc.   IIM      31
3   Rohan   24  Srinagar     MBA  Pvt.      34

In [219]:
#deleting a column
del df["Age+10"]
print(df)
#using pop
df["Age+10"] = df["Age"]+10
df.pop("Age+10")
df

     Name  Age   Address  Degree   Clg
0   Anshu   20    Jaipur   B.Sc.   IIT
1   Price   22   Jodhpur  B.Tech   NIT
2  Rajesh   21   Udaipur   M.Sc.   IIM
3   Rohan   24  Srinagar     MBA  Pvt.

     Name  Age   Address  Degree   Clg
0   Anshu   20    Jaipur   B.Sc.   IIT
1   Price   22   Jodhpur  B.Tech   NIT
2  Rajesh   21   Udaipur   M.Sc.   IIM
3   Rohan   24  Srinagar     MBA  Pvt.

In [220]:
df

     Name  Age   Address  Degree   Clg
0   Anshu   20    Jaipur   B.Sc.   IIT
1   Price   22   Jodhpur  B.Tech   NIT
2  Rajesh   21   Udaipur   M.Sc.   IIM
3   Rohan   24  Srinagar     MBA  Pvt.

In [221]:
df1 = pd.DataFrame([[1,2],[3,4]],columns=['a','b'])         #if we didn't write columns here then it will assign a and b name to rows
df2 = pd.DataFrame([[5,6],[7,8]],columns=['c','d'])
df1
df3 = pd.concat([df1,df2])
df3 = pd.concat([df1,df2],axis=1).reset_index()
df3 = pd.concat([df1,df2],axis=0).reset_index()
df3

   index    a    b    c    d
0      0  1.0  2.0  NaN  NaN
1      1  3.0  4.0  NaN  NaN
2      0  NaN  NaN  5.0  6.0
3      1  NaN  NaN  7.0  8.0

In [222]:
#transposing 
sr = pd.Series([1,2,3,4,5])
data = {"one"          : pd.Series([1,2,3,4,5]),
        "two"          : pd.Series([10,20,30,40,50]),
        "three"        : pd.Series([100,200,300,400,500]),
        "Four"         : pd.Series([1000,2000,3000,4000,5000]),
        "Five"         : pd.Series([10000,20000,30000,40000,50000]),
        }
df = pd.DataFrame(data)
print(df)
df.T

   one  two  three  Four   Five
0    1   10    100  1000  10000
1    2   20    200  2000  20000
2    3   30    300  3000  30000
3    4   40    400  4000  40000
4    5   50    500  5000  50000

           0      1      2      3      4
one        1      2      3      4      5
two       10     20     30     40     50
three    100    200    300    400    500
Four    1000   2000   3000   4000   5000
Five   10000  20000  30000  40000  50000

In [223]:
df.axes                 #rows and column labels

[RangeIndex(start=0, stop=5, step=1),
 Index(['one', 'two', 'three', 'Four', 'Five'], dtype='object')]

In [224]:
df.ndim                 #returns the dimension of data

2

In [225]:
df.dtypes

one      int64
two      int64
three    int64
Four     int64
Five     int64
dtype: object

In [226]:
df.head()                      #only first rows deafult
df.head(2)

   one  two  three  Four   Five
0    1   10    100  1000  10000
1    2   20    200  2000  20000

In [227]:
df.tail()           #last five rows by default
df.tail(3)

   one  two  three  Four   Five
2    3   30    300  3000  30000
3    4   40    400  4000  40000
4    5   50    500  5000  50000

In [228]:
df.empty                     #df is empty or not

False

In [230]:
df.sum()                  #row wise default
df.sum(axis=1)
# df['one'].sum(axis=1)

0    11111
1    22222
2    33333
3    44444
4    55555
dtype: int64

In [ ]:
df.mean()
df['one'].mean()

3.0

In [ ]:
df.median()

one          3.0
two         30.0
three      300.0
Four      3000.0
Five     30000.0
dtype: float64

In [ ]:
df.mode()
df['one'].mode()

0    1
1    2
2    3
3    4
4    5
Name: one, dtype: int64

In [ ]:
df.var()

one              2.5
two            250.0
three        25000.0
Four       2500000.0
Five     250000000.0
dtype: float64

In [ ]:
df.min()

one          1
two         10
three      100
Four      1000
Five     10000
dtype: int64

In [ ]:
df.max()
df['one'].max()

5

In [ ]:
####################
df.describe()

            one        two       three        Four          Five
count  5.000000   5.000000    5.000000     5.00000      5.000000
mean   3.000000  30.000000  300.000000  3000.00000  30000.000000
std    1.581139  15.811388  158.113883  1581.13883  15811.388301
min    1.000000  10.000000  100.000000  1000.00000  10000.000000
25%    2.000000  20.000000  200.000000  2000.00000  20000.000000
50%    3.000000  30.000000  300.000000  3000.00000  30000.000000
75%    4.000000  40.000000  400.000000  4000.00000  40000.000000
max    5.000000  50.000000  500.000000  5000.00000  50000.000000

In [ ]:
#pipe function (helps to apply a particular function aver a dataframe)
def add_(i,j):
    return i+j

def sub_(i):
    return i

df.pipe(add_,10)            # value of i will be taken form the dataframe and 10 will be added to that value

   one  two  three  Four   Five
0   11   20    110  1010  10010
1   12   30    210  2010  20010
2   13   40    310  3010  30010
3   14   50    410  4010  40010
4   15   60    510  5010  50010

In [233]:
df.pipe(sub_).pipe(add_,2)

   one  two  three  Four   Five
0    3   12    102  1002  10002
1    4   22    202  2002  20002
2    5   32    302  3002  30002
3    6   42    402  4002  40002
4    7   52    502  5002  50002

In [231]:
#apply function
df.apply(np.mean)

one          3.0
two         30.0
three      300.0
Four      3000.0
Five     30000.0
dtype: float64

In [232]:
df.apply(lambda x : x.max() - x.min())

one          4
two         40
three      400
Four      4000
Five     40000
dtype: int64

In [242]:
#in pipe we can perform multiple operation we can take the output of one operation as the input of the other

In [246]:
#Reindex Function (to represent the rows and columns in different way)
print(df)
df.reindex([2,4,0,3,1])                      #default is of rows
df.reindex(columns=["Five","Four","three","two","one"])

   one  two  three  Four   Five
0    1   10    100  1000  10000
1    2   20    200  2000  20000
2    3   30    300  3000  30000
3    4   40    400  4000  40000
4    5   50    500  5000  50000

    Five  Four  three  two  one
0  10000  1000    100   10    1
1  20000  2000    200   20    2
2  30000  3000    300   30    3
3  40000  4000    400   40    4
4  50000  5000    500   50    5

In [249]:
#Rename Function
df.rename(columns={"one":"One","two":"Two","three":"Three"},inplace = True,index = {0:'a',1:'b',2:'c',3:'d',4:'e'})
df

   One  Two  Three  Four   Five
a    1   10    100  1000  10000
b    2   20    200  2000  20000
c    3   30    300  3000  30000
d    4   40    400  4000  40000
e    5   50    500  5000  50000

In [255]:
#Sorting
data = { 'one'   : pd.Series([11, 51, 13, 41]),
         'two'   : pd.Series([10, 20, 3, 40]),
         'three' : pd.Series([100, 200, 50, 400]),
         'four'  : pd.Series([1000, 20, 230, 42])}
df = pd.DataFrame(data)
df

   one  two  three  four
0   11   10    100  1000
1   51   20    200    20
2   13    3     50   230
3   41   40    400    42

In [256]:
df.sort_values(by='one')

   one  two  three  four
0   11   10    100  1000
2   13    3     50   230
3   41   40    400    42
1   51   20    200    20

In [257]:
df.sort_values(by='one',ascending=False)

   one  two  three  four
1   51   20    200    20
3   41   40    400    42
2   13    3     50   230
0   11   10    100  1000

In [261]:
df.sort_values(by=['one','two'])

   one  two  three  four
0   11   10    100  1000
2   13    3     50   230
3   41   40    400    42
1   51   20    200    20

In [262]:
#Group by
cricket = {'Team'   : ['India', 'India', 'Australia', 'Australia', 'SA', 'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
           'Rank'   : [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
           'Year'   : [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
           'Points' : [876,801,891,815,776,784,834,824,758,691,883,782]
           }
df = pd.DataFrame(cricket)
df

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2015     801
2   Australia     1  2014     891
3   Australia     2  2015     815
4          SA     3  2014     776
5          SA     4  2015     784
6          SA     1  2016     834
7          SA     1  2017     824
8          NZ     2  2016     758
9          NZ     4  2014     691
10         NZ     1  2015     883
11      India     2  2017     782

In [264]:
df.groupby("Team").groups

{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}

In [266]:
df.groupby(["Team","Year"]).groups

{('Australia', 2014): [2], ('Australia', 2015): [3], ('India', 2014): [0], ('India', 2015): [1], ('India', 2017): [11], ('NZ', 2014): [9], ('NZ', 2015): [10], ('NZ', 2016): [8], ('SA', 2014): [4], ('SA', 2015): [5], ('SA', 2016): [6], ('SA', 2017): [7]}

In [267]:
df.groupby(["Team","Year"]).get_group(("Australia",2014))

        Team  Rank  Year  Points
2  Australia     1  2014     891

In [268]:
df.groupby('Team').sum()['Points']

Team
Australia    1706
India        2459
NZ           2332
SA           3218
Name: Points, dtype: int64

In [271]:
df.groupby("Team").sum()["Points"].sort_values(ascending=False)

Team
SA           3218
India        2459
NZ           2332
Australia    1706
Name: Points, dtype: int64

In [272]:
groups = df.groupby('Team')
groups['Points'].agg([np.sum,np.mean,np.std,np.max,np.min])

C:\Users\kulwa\AppData\Local\Temp\ipykernel_20264\881329295.py:2: FutureWarning: The provided callable <function sum at 0x00000240FF317560> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  groups['Points'].agg([np.sum,np.mean,np.std,np.max,np.min])
C:\Users\kulwa\AppData\Local\Temp\ipykernel_20264\881329295.py:2: FutureWarning: The provided callable <function mean at 0x00000240FF328680> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  groups['Points'].agg([np.sum,np.mean,np.std,np.max,np.min])
C:\Users\kulwa\AppData\Local\Temp\ipykernel_20264\881329295.py:2: FutureWarning: The provided callable <function std at 0x00000240FF3287C0> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  groups['Points'].agg([np.sum,np.mean,np.std,np.max,np.min])
C:\Users\kulwa\AppData\Local\Temp\ipykernel_20264\881329295.py:2: FutureWarning: The provided callable <function max at 0x00000240FF317C40> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  groups['Points'].agg([np.sum,np.mean,np.std,np.max,np.min])
C:\Users\kulwa\AppData\Local\Temp\ipykernel_20264\881329295.py:2: FutureWarning: The provided callable <function min at 0x00000240FF317D80> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  groups['Points'].agg([np.sum,np.mean,np.std,np.max,np.min])

            sum        mean        std  max  min
Team
Australia  1706  853.000000  53.740115  891  815
India      2459  819.666667  49.702448  876  782
NZ         2332  777.333333  97.449132  883  691
SA         3218  804.500000  28.769196  834  776

In [274]:
df.groupby('Team').filter(lambda x : len(x) == 3)

     Team  Rank  Year  Points
0   India     2  2014     876
1   India     3  2015     801
8      NZ     2  2016     758
9      NZ     4  2014     691
10     NZ     1  2015     883
11  India     2  2017     782